bookstores = {
    "Магистр": {"Лермонтов", "Достоевский", "Пушкин", "Тютчев"},
    "ДомКниги": {"Толстой", "Грибоедов", "Чехов", "Пушкин"},
    "БукМаркет": {"Пушкин", "Достоевский", "Маяковский"},
    "Галерея": {"Чехов", "Тютчев", "Пушкин"}
}


can_buy_together = [store for store, books in bookstores.items() if "Достоевский" in books and "Пушкин" in books]
print("Можно приобрести книги Достоевского и Пушкина одновременно в магазинах:", can_buy_together)


bookstores["Галерея"].add("Грибоедов")
print("Автор Грибоедов добавлен в ассортимент магазина Галерея:", bookstores["Галерея"])


missing_books = bookstores["ДомКниги"] - bookstores["Галерея"]
print("Книги из магазина ДомКниги, отсутствующие в магазине Галерея:", missing_books)